; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 5100)
	(= (fuel plane1) 624)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 5)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city2)
	(= (capacity plane2) 12649)
	(= (fuel plane2) 3449)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 19)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city3)
	(= (capacity plane3) 2455)
	(= (fuel plane3) 758)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 3)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at plane4 city1)
	(= (capacity plane4) 12282)
	(= (fuel plane4) 3059)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 15)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 1)
	(at plane5 city1)
	(= (capacity plane5) 14339)
	(= (fuel plane5) 4212)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 10)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 9)
	(at person1 city2)
	(at person2 city3)
	(at person3 city3)
	(at person4 city0)
	(at person5 city3)
	(at person6 city1)
	(at person7 city1)
	(at person8 city0)
	(at person9 city3)
	(at person10 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 619)
	(= (distance city0 city2) 880)
	(= (distance city0 city3) 587)
	(= (distance city1 city0) 619)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 909)
	(= (distance city1 city3) 516)
	(= (distance city2 city0) 880)
	(= (distance city2 city1) 909)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 821)
	(= (distance city3 city0) 587)
	(= (distance city3 city1) 516)
	(= (distance city3 city2) 821)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city3)
	(at person2 city3)
	(at person3 city3)
	(at person4 city3)
	(at person5 city1)
	(at person6 city3)
	(at person7 city0)
	(at person8 city3)
	(at person9 city3)
	(at person10 city0)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (fly plane3 city3 city1)
   deleted: (at plane3 city3)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 0 to 516, (fuel plane3) from 758 to 242
   goals met: 3 of 10
2. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 10
3. (board person6 plane5 city1)
   deleted: (at person6 city1)
   added: (in person6 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 3 of 10
4. (board person7 plane5 city1)
   deleted: (at person7 city1)
   added: (in person7 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 3 of 10
5. (refuel plane2 city2)
   changed: (fuel plane2) from 3449 to 12649
   goals met: 3 of 10
6. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 516 to 4621, (fuel plane2) from 12649 to 8544
   goals met: 3 of 10
7. (debark person1 plane2 city3)
   deleted: (in person1 plane2)
   added: (at person1 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 10
8. (board person5 plane2 city3)
   deleted: (at person5 city3)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 10
9. (board person10 plane2 city3)
   deleted: (at person10 city3)
   added: (in person10 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 10
10. (fly plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 4621 to 7201, (fuel plane2) from 8544 to 5964
   goals met: 4 of 10
11. (debark person5 plane2 city1)
   deleted: (in person5 plane2)
   added: (at person5 city1)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 10
12. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 7201 to 10296, (fuel plane2) from 5964 to 2869
   goals met: 5 of 10
13. (debark person10 plane2 city0)
   deleted: (in person10 plane2)
   added: (at person10 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 10
14. (refuel plane2 city0)
   changed: (fuel plane2) from 2869 to 12649
   goals met: 6 of 10
15. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 6 of 10
16. (zoom plane2 city0 city3)
   deleted: (at plane2 city0)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 10296 to 21449, (fuel plane2) from 12649 to 1496
   goals met: 6 of 10
17. (debark person4 plane2 city3)
   deleted: (in person4 plane2)
   added: (at person4 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 10
18. (fly plane5 city1 city0)
   deleted: (at plane5 city1)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 21449 to 24544, (fuel plane5) from 4212 to 1117
   goals met: 7 of 10
19. (debark person7 plane5 city0)
   deleted: (in person7 plane5)
   added: (at person7 city0)
   changed: (onboard plane5) from 2 to 1
   goals met: 8 of 10
20. (board person8 plane5 city0)
   deleted: (at person8 city0)
   added: (in person8 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 8 of 10
21. (refuel plane5 city0)
   changed: (fuel plane5) from 1117 to 14339
   goals met: 8 of 10
22. (fly plane5 city0 city3)
   deleted: (at plane5 city0)
   added: (at plane5 city3)
   changed: (total-fuel-used) from 24544 to 27479, (fuel plane5) from 14339 to 11404
   goals met: 8 of 10
23. (debark person6 plane5 city3)
   deleted: (in person6 plane5)
   added: (at person6 city3)
   changed: (onboard plane5) from 2 to 1
   goals met: 9 of 10
24. (debark person8 plane5 city3)
   deleted: (in person8 plane5)
   added: (at person8 city3)
   changed: (onboard plane5) from 1 to 0
   goals met: 10 of 10
